import express from 'express';

const router = express.Router();

const coupletLines = [
  "اب تو جاتے ہیں بت کدے سے 'میر'",
  "پھر ملیں گے اگر خدا لایا",

  "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے",
  "بہت نکلے مرے ارمان لیکن پھر بھی کم نکلے",

  "دلِ نادان تجھے ہوا کیا ہے",
  "آخر اس درد کی دوا کیا ہے",

  "زاہد شراب پینے دے مسجد میں بیٹھ کر",
  "یا وہ جگہ بتا دے جہاں پر خدا نہ ہو",

  "خودی کو کر بلند اتنا کہ ہر تقدیر سے پہلے",
  "خدا بندے سے خود پوچھے بتا تیری رضا کیا ہے",

  "ستاروں سے آگے جہاں اور بھی ہیں",
  "ابھی عشق کے امتحان اور بھی ہیں",

  "ہم آہ بھی کرتے ہیں تو ہو جاتے ہیں بدنام",
  "وہ قتل بھی کرتے ہیں تو چرچا نہیں ہوتا",

  "دل ناامید تو نہیں ناکام ہی تو ہے",
  "لمبی ہے غم کی شام مگر شام ہی تو ہے",

  "مجھ سے پہلی سی محبت مری محبوب نہ مانگ",

  "آنکھ سے دور نہ ہو دل سے اتر جائے گا",
  "وقت کا کیا ہے گزرتا ہے گزر جائے گا",

  "اب وہ شرارتوں کے زمانے گزر گئے",

  "وقت اچھا بھی آئے گا 'ناصر'",
  "غم نہ کر زندگی پڑی ہے ابھی",

  "خواب ہوتے ہیں دیکھنے کے لیے",
  "ان میں جا کر مگر رہا نہ کرو",

  "آج اک اور برس بیت گیا اس کے بغیر",
  "جس کے ہوتے ہوئے ہوتے تھے زمانے میرے",

  "اور بھی دکھ ہیں زمانے میں محبت کے سوا",
  "راحتیں اور بھی ہیں وصل کی راحت کے سوا",

  "ہم کو معلوم ہے جنت کی حقیقت لیکن",
  "دل کے خوش رکھنے کو 'غالب' یہ خیال اچھا ہے",

  "میں اکیلا ہی چلا تھا جانبِ منزل مگر",
  "لوگ ساتھ آتے گئے اور کارواں بنتا گیا",

  "عشق نے 'غالب' نکما کر دیا",
  "ورنہ ہم بھی آدمی تھے کام کے",

  "ان کے دیکھے سے جو آ جاتی ہے منہ پر رونق",
  "وہ سمجھتے ہیں کہ بیمار کا حال اچھا ہے",

  "یہ عشق نہیں آساں اتنا ہی سمجھ لیجے",
  "اک آگ کا دریا ہے اور ڈوب کے جانا ہے",

  "رگوں میں دوڑتے پھرنے کے ہم نہیں قائل",
  "جب آنکھ ہی سے نہ ٹپکا تو پھر لہو کیا ہے",

  "یہ جبر بھی دیکھا ہے تاریخ کی نظروں نے",
  "لمحوں نے خطا کی تھی صدیوں نے سزا پائی",

  "وہ آئے گھر میں ہمارے خدا کی قدرت ہے",
  "کبھی ہم ان کو کبھی اپنے گھر کو دیکھتے ہیں",

  "زندگی زندہ دلی کا ہے نام",
  "مردہ دل خاک جیا کرتے ہیں",

  "ہم کو مٹا سکے یہ زمانے میں دم نہیں",
  "ہم سے زمانہ خود ہے زمانے سے ہم نہیں",

  "اب تو اتنی بھی میسر نہیں مے خانے میں",
  "جتنی ہم چھوڑ دیا کرتے تھے پیمانے میں",

  "کبھی کسی کو مکمل جہاں نہیں ملتا",
  "کہیں زمین کہیں آسمان نہیں ملتا",

  "شکایتِ ظلمتِ شب سے تو کہیں بہتر تھا",
  "اپنے حصے کی کوئی شمع جلاتے جاتے",

  "نہ نیند پوری ہوئی نہ خواب مکمل ہوئے",
  "وقت نے کہا کاش تھوڑا اور صبر ہوتا",
  "صبر نے کہا کاش تھوڑا اور وقت ہوتا",

  "احباب نے، رقیب نے، دل نے، رفیق نے",
  "یہ بھی رہا نہ یاد کہ کس کس نے مات دی",
 
  
  "آزاد مجھ کو کر دے، اے قید کرنے والے،",
  "میں بےزبان ہوں قیدی، تُو چھوڑ کر دُعا لے",
  "دل سے جو بات نکلتی ہے اثر رکھتی ہے،",
  "پر نہیں طاقتِ پرواز مگر رکھتی ہے",
  "عشق تیری انتہا، عشق میری انتہا،",
  "تو بھی ابھی ناتمام، میں بھی ابھی ناتمام",
  "مسجد خدا کا گھر ہے، پینے کی جگہ نہیں،",
  "کافر کے دل میں جا، وہاں خدا نہیں",
  "کافر کے دل سے آیا ہوں یہ دیکھ کر فراز،",
  "خدا موجود ہے وہاں پر اُسے پتا نہیں",
  "دل نااُمید تو نہیں ناکام ہی تو ہے،",
  "لمبی ہے غم کی شام، مگر شام ہی تو ہے",
  "عجیب دستور ہے محبت کا،",
  "روٹھ کوئی جاتا ہے، ٹوٹ کوئی جاتا ہے",
  "عمر بھر اُٹھایا بوجھ اُس 'کیل' نے،",
  "اور لوگ تعریف 'تصویر' کی کرتے رہے",
  "کچھ اِس قدر داخل ہوا میرے ذہن میں وہ،",
  "کہ سانسوں میں آج تک اُسی کی مہک ہے",
  "اک طرزِ تغافل ہے سو وہ اُن کو مبارک،",
  "اک طرزِ تمنا ہے سو ہم کرتے رہیں گے",
  "سینے میں جو دب گئے ہیں، وہ جذبات کیا کہیں،",
  "اب خود ہی سمجھ لیجیے، ہر بات کیا کہیں",
  "زندگی سے کچھ زیادہ نہیں، بس اتنی سی فرمائش ہے،",
  "اب تصویر سے نہیں، تفصیل سے ملنے کی خواہش ہے",
  "تھوڑا سکون بھی ڈھونڈیے جناب،",
  "یہ ضروریات تو کبھی ختم نہیں ہوں گی",
  "یہ نہ تھی ہماری قسمت کہ وصالِ یار ہوتا،",
  "اگر اور جیتے رہتے تو یہی انتظار ہوتا",
  "آنکھ سے دور نہ ہو دل سے اُتر جائے گا،",
  "وقت کا کیا ہے گزرتا ہے گزر جائے گا",
  "اُن کے دیکھے سے جو آ جاتی ہے منہ پر رونق،",
  "وہ سمجھتے ہیں کہ بیمار کا حال اچھا ہے",
  "وقت اچھا بھی آئے گا ناصر، غم نہ کر،",
  "زندگی پڑی ہے ابھی"


];

  
// GET /api/random-line
router.get('/girah', (req, res) => {
    const randomIndex = Math.floor(Math.random() * coupletLines.length);
    const randomLine = coupletLines[randomIndex];
    res.json({ line: randomLine });
  });
  
  export default router;
  