[
    {
        "name": "Parveen Shakir",
        "image": "/images/shakir.jpg",
        "description": "ممکنہ فیصلوں میں ایک ہجر کا فیصلہ بھی تھا \nہم نے تو ایک بات کی اس نے کمال کر دیا",
          "biography": "Parvin Shakir was a poet of new and fresh expression who subtly emoted the feelings of women about men. Her poetry is neither the sighing and lamenting traditional poetry nor openly romantic poetry. The intensity of emotion and its simple yet artistic expression is the characteristic of Parveen Shakir's poetry. Her poetry is the manifestation of the struggle of union and separation, where neither of the two reaches fruition. \n Parvin’s sincerity, exquisiteness, and purity of expression helped her achieve a distinguished position in women’s Urdu poetry. According to Gopi Chand Narang, the scenario of new poetry is incomplete without Parveen Shakir's sigil. Commenting on Parvin Shakir's poetry, her mentor Ahmad Nadeem Qasmi said that Parveen's poetry was the spread of this couplet of Ghalib, ‘phuu.nkaa hai kis ne gosh-e-mohabbat me.n ai KHudaa, afsuun-e-intizaar tamannaa kahe.n jise’. He explains that the longing, that is the spell of waiting, taught from Homer to Ghalib, the best of poetry, to beat in the human heart, and Parvin Shakir with this spell made Urdu poetry bathe in the rainbow of true passion. \n Among female poets, Parvin Shakir seems to give a new dimension to Urdu poetry due to her unique tone and expression of emotional and psychological issues of women. She uses a fearless and fierce idiom, and is seen boldly protesting against oppression and tyranny, and does not draw the veil of unnecessary modesty over her emotions and thoughts. Her motifs are limited, yet the reader finds in her poetry melody, the sincerity of the experiences, and a pleasant-sounding fresh expression. Parvin Shakir was born in Karachi on November 24, 1952. \nHer original hometown was Lahiria Sarai in the Darbhanga district of Bihar. Her father, Shakir Hussain Saqib, who was also a poet, had settled in Karachi after the formation of Pakistan. She started writing poetry at an early age and was inspired by her father. Parveen passed her matriculation examination from Rizvia Girls School, Karachi and, BA from Sir Syed Girls College. In 1972, she studied English Literature in Karachi. Later, she earned an MA from the university, and then an M.A. in linguistics. After completing her education, she joined Abdullah Girls College, Karachi as a teacher. In 1976, she married her cousin Naseer Ali, a doctor in the military. Naseer was Parvin’s choice but sadly the marriage ended with divorce. She has one son from Dr. Naseer. After teaching in the college for 9 years, Parveen passed the Pakistan Civil Service Examination and was appointed Second Secretary Central Board of Revenue in 1982. Later she served as Deputy Collector in Islamabad. \n At the tender age of 25, her first collection of works, 'Khushbuu', came to the fore and caused a stir in literary circles. She was awarded the Adam G Award for this collection. Parvin’s personality was full of self-confidence which is also reflected in her poetry. Due to this, she faced all kinds of difficulties in her life. Within a span of 18 years, four of her poetry collections namely, ‘Khushbuu’, ‘Sad-Rang’, ‘Khud-Kalami’, and ‘Inkar’ came to light. In 1994, her last collection ‘Maah-e-Tamaam’ was published. In 1985, she received the Dr. Muhammad Iqbal Award and in 1986, the USIS Award. She was also awarded the Faiz Ahmed Faiz International Award and the country's prestigious award, the Pride of Performance. \n She passed away in a car accident on 26th December 1994. Her first collection of poems, 'Khushbuu', describes the romance and emotions of a teenage girl, in which she explores her personal life experiences in deep thought and broad imagination, revealing the state of the heart of a woman in love. Time and again, in her poetry, it seems as if she not only wants to be loved but also wants her lover to express it in words. Parvin’s poetry is an interlude to a girl entering adulthood, and the tale-bearer of a woman fettered in the knot of marriage. Her couplets attempt to convey a message of awakening to the new generation, challenging the misconception of marriage and the man's monopoly on women. Neither did she write poetry which repeated the same emotions over and over again nor did she submit to the age-old oriental modesty that a woman has to abide by. She excluded transcendence from poetry and encouraged Urdu women's poetry to speak in its own way."
        
            },
    {
      "name": "Faiz Ahmad Faiz",
      "image": "/images/faiz.webp",
      "description": "دل ناامید تو نہیں ناکام ہی تو ہے\nلمبی ہے غم کی شام مگر شام ہی تو ہے",
      "biography": "Faiz Ahmad Faiz was among the most celebrated and popular shayars. He faced political repression for his revolutionary views. Faiz was his pseudonym. His birth took place in the year 1911, in Sialkot, Punjab, from where he did his basic education from Church Mission School. \n Later on, he did his Masters in English and Arabic from Government College, Lahore. During his college days, he continued to pursue his poetic aspirations. In 1936, he took up the post of an English lecturer at M.A.O. College, Amritsar. \n When the Progressive Movement in India gathered momentum in 1936, he was one of the protagonists. Faiz beautifully blended the grief of love with sorrows of life in his poetry which struck a chord with youth. In 1939, when his first collection ‘Naqsh-e-Faryadi’ was published, the literary world was rocked with the echo. During that time, he also assumed the responsibility of editorship of ‘Adab-e-Lateef’. In 1940, Faiz was appointed lecturer at the Hailey College of Commerce, Lahore. This was the period when World War was at its peak and nations were uniting against fascism, consequently Faiz also joined army. In 1947, Faiz took up a position in the Pakistan Times. After that he became editor of “Imroz” and received accolades in journalism too. After Pakistan came into existence, he began working for the rights of labor and was appointed Vice President of Trade Union Federation. He participated in the I.L.O. Geneva Conference as a spokesperson for labor. On March 9, 1951, Faiz was arrested under the Pakistan Safety Order Act for Rawalpindi case for which he was imprisoned. His second collection ‘Dast-e-saba’ commemorates his confinement in Hyderabad jail.\n  Faiz began his poetry with ghazals and steadily shifted his attention to nazm and is acknowledged a renowned poet of both forms among progressive poets. He is equally admired in India, Pakistan as in the western countries. His ghazals have been translated into several languages. He was felicitated with a large number of scholarly awards, particularly the Lenin Peace Prize in 1962 and his Gazals are sung by almost every popular singer. Compositions of poetry: Naqsh-e-faryadi, Dast-e-saba, Zindaan Naama, Dast-e- Tah-e-Sang, Sar-e-Wadi-e-Seena, Sham-e-Sheher-e-Yaaran, Mere Dil Mere Musafir. His complete poetry has been published as ‘Nuskhahaae Wafa’. \n Faiz passed away on 20th Nov 1984 in Lahore."
    },
    {
      "name": "Ahmad Faraz",
      "image": "/images/faraz.jpg",
      "description": "وعدہ کیا تھا اس نے کسی شام کا کبھی\n ہم آج تک ہیں گھر میں چراغاں کیے ہوۓ",
      "biography": "Syed Ahmad Shah (1931-2008), known as Ahmad Faraz, was born in Nav Shahra with ancestral roots in Kohat; he studied at Islamia College, Kohat, Edwards College, Peshawar, and Peshawar University, earning M.A. degrees in Urdu and Persian. \nHe began his career as a producer at Radio Pakistan and later worked as a lecturer at Islamia College, Peshawar; he opposed military dictatorship in Pakistan, leading to his arrest and a six-year self-imposed exile in Europe and Canada. Upon returning, he held senior administrative roles, including Resident Director of Pakistan National Centre, Director of Akademy Adabiyat Pakistan, Lok Wirsa, and Chairperson of the National Book Foundation.\n A prolific poet, he authored numerous anthologies like 'Tanha Tanha,' 'Dard-e-Aashob,' 'Janan Janan,' 'Shubkhoon,' 'Merey Khwab Reza Reza,' 'Beaawara Gali Koochon Mein,' 'Nabeena Shar Mein Aaeena,' 'Pus Andaz Mausam,' and 'Khwab-e-Gul Pareshan Hai,' and translated poetry in 'Sub Awazein Meri Hain.' He also compiled a selection of Kunwar Mahinder Singh Bedi's poetry in 'Ai Ishq Junoon Pesha' and published his complete works as 'Shahr-e-Sukhan Aaraasta Hai.' Faraz received awards like the Adamji Award, Abaseen Award, Kamal-e-Fun Award, and Hilal-e-Imtiyaz, which he returned in protest, and was posthumously awarded the Hilal-e-Pakistan."
    },
    {
      "name": "Mirza Ghalib",
      "image": "/images/galib.jpeg",
      "description": "کوئی امید بر نہیں آتی \nکوئی صورت نظر نہیں آتی",
      "biography": "Mirza Ghalib, born Asadullah Khan (1797–1869), was the greatest Urdu poet of the Mughal era, known for his poetic surname 'Ghalib,' meaning 'victor.' He is the last of the great Delhi poets and the first of the great modern poets, standing between two worlds—trained in classical Persian and mystic philosophy, yet influenced by Western ideas and the Indian Renaissance.\nGhalib’s life was one of uninterrupted affliction, suffering, and grief, except for a brief period in his early youth. Born in Agra to a family of distinguished Seljuqid Turks, he lost his father at five and his uncle at nine, leading to an indulgent upbringing that fostered unfrugal habits and youthful excesses. Married at thirteen, he moved to Delhi in 1812, where he faced financial struggles, lived on borrowed money, and endured a tragic domestic life—losing all seven of his children and adopting his wife’s nephew, who also died young.\nDespite his hardships, Ghalib was an aristocrat by temperament, proud of his lineage and carrying his self-respect and independence to an extreme. He was warm-hearted, generous, and free from dogmatism, loving life’s pleasures—wine, women, chess, and mangoes—but his pride and desire to live like his ancestors often led to trouble.\nGhalib’s poetic career began at ten, and though he initially imitated Persian poets like Bedil, he later developed a simpler, purer style. He wrote more in Persian but is celebrated for his Urdu works, which include profound Ghazals expressing sensuous love, existential questions, and a deep appreciation for life’s beauty. His disillusionment was rooted in realism, not cynicism.\nGhalib’s recognition came late in life, with titles from Bahadur Shah Zafar and the post of royal historiographer. However, the 1857 Mutiny shattered his dreams. Despite his struggles, he remained witty and playful, finding joy even in his darkest moments.\nGhalib’s letters, written in a simple and intimate style, revolutionized Urdu prose. His influence on modern Urdu literature is profound, and his works continue to inspire generations. He remains a timeless figure, cherished for his intellect, spiritual depth, and unparalleled poetic genius."
    },
    {
      "name": "Bahadur Shah Zafar",
      "image": "/images/bahadur.jpeg",
      "description": "کتنا ہے بد نصیب ظفرؔ دفن کے لیے\nدو گز زمین بھی نہ ملی کوئے یار میں",
      "biography": "Mirza Abul Muzaffar Mohammad Sirajuddin (1775–1862), titled Bahadur Shah and known by his pen name Zafar, was born in Delhi’s Red Fort, where he received education in Arabic, Persian, combat, and archery.\nHe grew up with a deep interest in poetry, music, spiritualism, and calligraphy, and gifted handwritten copies of the Quran to prominent mosques in Delhi.\nZafar ascended the throne at 62, ruling a diminished Mughal Empire reduced to the vicinity of the Red Fort. A liberal emperor who respected all faiths and loved peace, he was accused by the British of treason for his alleged role in the 1857 uprising.\nAfter the British army entered Delhi, Zafar sought refuge in Humayun’s mausoleum, where he surrendered with his wife Zeenat Mahal and two sons. He faced immense humiliation: his three sons and a grandson were beheaded, their heads displayed publicly, and many princes were exiled, imprisoned, or killed.\nFollowing a 42-day trial, Zafar was sentenced to death, which was later commuted to exile. In 1858, he was deported to Rangoon (now Yangon, Myanmar) with his wife, two sons, and a daughter-in-law, spending his last four years in misery and humiliation.\nZafar was a sensitive poet whose work reflects the decline of the Mughal Empire, marked by pity, pathos, and the human predicament. He sought mentorship from Mirza Naseer, Zauq, and later Ghalib, and wrote an annotation of Sheikh Saadi’s Gulistan.\nDespite claims that much of his poetry was written by mentors, the tone and tenor of his work are distinctly his own. Zafar left behind a vast collection of ghazals in four volumes, known as his Kulliyat.\nZafar’s burial spot remained untraceable until a mausoleum was erected in 1991, and his crown, taken from the Red Fort, is now exhibited in the Royal Collection in London."
    },
    {
      "name": "Sahir Ludhianvi",
      "image": "/images/sahir.webp",
      "description": "ویسے تو تمہیں نے مجھے برباد کیا ہے\nالزام کسی اور کے سر جائے تو اچھا",
      "biography": "Sahir Ludhianvi, who has been labeled by objectors as Anfwan-e-Shabab Ka Shayar for his poetry, in particular, for stirring the hearts of youngsters and writing literary songs for films, is one of the popular poets and the pride of progressive poetry. The way in which Sahir has given poetic form to their emotions and moods has not been given by any of his contemporary poets.\n\nThe fact is that by mixing romance and protest, Sahir, with his individuality, gave a new direction to the poetry of the progressive movement. There is a warmth in his political and protest poems. His choice of words, method of using similes and metaphors is so complete and comprehensive that it is beyond the reach of other poets.\n\nSahir was born on March 8, 1921, in a feudal family of Ludhiana and was named Abdul Hai. His father's name was Chaudhry Fazal Mohammad. His childhood was very difficult. His father married eleven times and divorced all of them except Sahir's mother. In 1934, his parents got divorced, and his mother faced a tough legal battle to get his custody. Sahir lived with his mother but was deprived of his father's wealth, and his childhood was spent in financial constraints.\n\nSahir's formal education was from Ludhiana. After passing the matriculation exam, he was admitted to Government College Ludhiana. He studied there for two years and also started writing poetry. He would participate in mushairas and soon gained popularity. However, he was expelled from college due to his rebellious ideas and love affair with a girl from an influential family.\n\nAfter leaving Ludhiana, Sahir moved to Lahore, where he got admission to Dayal Singh College and joined the Progressive Writers' Association. He started editing literary magazines like 'Adab-e-Latif' and 'Shahkaar'. In 1943, his first poetry collection 'Talkhiyan' (Bitterness) was published, which made him an overnight sensation.\n\nIn 1949, due to political reasons, Sahir had to leave Lahore and migrated to Bombay (now Mumbai). Here, he started writing lyrics for Hindi films and became one of the most sought-after lyricists. His songs, rich in poetry and emotions, became timeless classics. Some of his most famous songs include 'Jinhe Naaz Hai Hind Par', 'Kabhi Kabhi Mere Dil Mein', and 'Main Pal Do Pal Ka Shayar Hoon'.\n\nSahir's poetry reflected his deep thoughts on love, revolution, and social justice. He never married and remained devoted to his craft. His contribution to Urdu poetry and Indian cinema earned him many accolades, including the Padma Shri and Filmfare Awards.\n\nOn October 25, 1980, Sahir Ludhianvi passed away due to a sudden heart attack. His legacy lives on through his poetry and songs, which continue to inspire generations."
    },
    
    {
      "name": "Jaun Eliya",
      "image": "/images/jounElia.jpg",
      "description": "جونؔ ہم زندگی کی راہوں میں\nاپنی تنہا روی کے مارے ہیں",
      "biography": "Syed Jaun Asghar (1931–2002), popularly known as Jaun Elia, was born in Amroha, where he received early education under his father, Shafiq Hasan Elia, and earned degrees in Urdu, Persian, and Arabic.\nHe migrated to Pakistan in 1957, settling in Karachi, where he worked at the Ismailia Association of Pakistan (1963–1968) and later with the Urdu Dictionary Board. He also edited Aalami Digest with Zahida Hina.\nJaun Elia was deeply interested in history, philosophy, and religion, which influenced his unique personality and poetry, known for its effortless expression and immediacy of appeal.\nHe published his first anthology, 'Shaayed,' in 1991, while posthumous collections like 'Yaani' (2003), 'Gumaan' (2004), 'Lekin' (2006), 'Goyaa' (2008), and a prose work titled 'Farnood' (2008) were compiled by his trusted companion Khalid Ahmed Ansari.\nKhalid also compiled Jaun’s epic poem 'RAMOOZ,' a book titled 'MaiN Ya MaiN' containing articles about Jaun by friends and literary figures, and is currently working on Jaun’s long-awaited collection, 'KYUN.'\nJaun had also collected his letters to Zahida Hina, his former wife, and translated works like 'Kitab-ut-Tawwaseen' and 'Jauhar-e-Salqui' by Mansoor Hallaj, which remain unpublished.\nThe Government of Pakistan honored him with the prestigious Award of Excellence for his contributions to literature."
    },
    {
      "name": "Allama Iqbal",
      "image": "/images/iqbal.jpeg",
      "description": "ستاروں سے آگے جہاں اور بھی ہیں\nابھی عشق کے امتحاں اور بھی ہیں",
      "biography": "Mohammad Iqbal (1877–1938), a descendant of a Kashmiri Brahmin family that embraced Islam in the seventeenth century, was born and settled in Sialkot.\nHe received a traditional education in Arabic, Persian, and Urdu, followed by a liberal education that shaped his thought and poetry. After studying at the Scottish Mission School, he earned an M.A. in Philosophy, attended Trinity College, and became a Bar-at-Law. He later obtained a doctorate from Germany with his thesis, 'The Development of Metaphysics in Persia.'\nIqbal worked as a philosophy teacher, lawyer, and politician, attending the second Round Table Conference. While he supported the idea of Pakistan and is revered as its national poet, he also wrote a famous patriotic song celebrating India’s greatness. King George V knighted him, and he was thereafter known as Sir Mohammad Iqbal.\nIqbal wrote in Persian and Urdu and is regarded as the poet-philosopher of the East. He addressed the Muslim ummah, believed in the philosophy of wahdatul wujood, and propounded the concept of khudi (selfhood), emphasizing self-realization, love, and perseverance. His vision included the idea of the 'complete man' and a metaphoric dialogue with the divine.\nHis poetry uniquely blends message and art, reconfiguring metaphors, myths, and symbols to revisit history, philosophy, and Islamic faith. His works include 'Asraar-e Khudi,' 'Rumooz-e Bekhudi,' 'Baang-e Daraa,' 'Baal-e Jibreel,' 'Payaam-e Mashriq,' 'Zaboor-e ‘Ajm,' 'Javed Naama,' 'Zarb-e Kaleem,' and 'Armaghaan-e Hijaz,' along with his lectures compiled in 'The Reconstruction of Religious Thought in Islam.'"
    },
     
    {
      "name": "Dagh Dehlvi",
      "image": "/images/dagh.jpeg",
      "description": "وفا کریں گے، نباہیں گے، بات مانیں گے\nتمہیں بھی یاد ہے کچھ، یہ کلام کس کا تھا",
      "biography": "Nawab Mirza Khan Dagh Dehlavi (1831-1905), was born and brought up in the Red Fort of Delhi where his mother was married to Prince Mirza Mohammad Sultan, son of Bahadur Shah Zafar. After his father’s death, he had to leave the Red Fort, and after the fall of Delhi in 1857, he had to move to Rampur where he lived in comfort for more than a decade. \nLater, his changing conditions, for good or bad, took him to other centres of renown like Lucknow, Patna, Calcutta, and Hyderabad. As a disciple of Zauq himself, and with a large number of eminent disciples to his own credit, Dagh deliberated upon the aesthetic principles of ghazal as a form of intimate poetic conversation. He charged the common speech and combined the poetic manners of the Lucknow and Delhi schools.\n In its totality, Dagh’s poetry is idiomatic and appealing, laden with emotions and good humour. He did not take the idea of love to philosophical heights but engaged with the experience of love at a human level, bringing it close to eroticism. Cumulatively, he is playful with language, least Persianised in his diction, witty in turns of phrases, urbane in addressing, and full of gaiety and simplicity in his essential approach to his material. Apart from his four divaans, representing the last hallmarks of classical poetry, he has left behind a bunch of letters and a long narrative poem."
    },
    
      {
        "name": "Habib Jalib",
        "image": "/images/jalib.jpeg",
        "description": "وہی حالات ہیں فقیروں کے\nدن پھرے ہیں فقط وزیروں کے",
        "biography": "Habib Jalib was one of the revolutionary poets from Pakistan. He was born on 24 March 1929 as Habib Ahmad in a village near Hoshiarpur British India. His family migrated to Pakistan after partition. Habib started working as a proof-reader in Daily Imroze Karachi. \nHe wrote in simple language and generally addressed common issues directly related to people. He was a staunch democrat and always opposed martial law, authoritarianism and state oppression. Some of his important books are Sir-e-Maqtal, Zikr Behte Khoon Ka, Gumbad-e-Bedar, Kulyaat e Habib Jalib, Is Shehar-e-Kharabi Main, Goshay Main Qafas Ke, Harf-e-Haqq, Harf-e-Sar-e-Daar, Ehad-e-Sitam etc. \n Habib Jalib passed away in Lahore on 12 March 1993. He had received the highest Civilian award of Pakistan Nishan-e-Imtiyaz (posthumously) in 2009."
      },
      
      {
        "name": "Noon Meem Rashid",
        "image": "/images/noon.jpeg",
"description": "اجاڑ آنکھوں میں رت جگوں کا عذاب اترا ہے نیم شب کو\nجو درد جاگا ہے شام ڈھلتے تو شعر لکھا ہے نیم شب کو",
  "biography": "N.M. Rashid is a poet who not only expressed the spirit of his time but also created a new consciousness in the new generation and set new standards on a creative level.\nHis name is at the forefront of popularizing independent poetry. Deviating from the tradition, Rashid laid the foundation of a new style in Urdu poetry.\nHe is one of the few Urdu poets whose poetry is neither merely poetry of language nor mere poetry of conditions. His poetry was of thought and wisdom.\nHe thinks himself and persuades others to think too. And the scope of his thinking is very wide, cosmic and universal.\nBreaking down religious, geographical, linguistic and other boundaries, he recites the eulogy of a universal human being who is a new ideal human being whom he calls the \"Adam-e-Nau\" or the new man.\nHe is a human being with complete harmony in appearance and inwardness.\nRashid's poetic temperament is similar to that of poets like Rumi, Iqbal, Dante and Milton who do not fall below a certain level because the issues and themes they deal with are different from the general issues and conditions that diversity elasticity and flexibility in lyrical poetry.\nIt takes an intellectual temperament to enjoy his poetry and in that sense he is a poet of qualities, not of the people.\n\nNM Rashid was born on August 1, 1910 in a prosperous family in the town of Akalgarh (now Alipur Chat) in Gujranwala District of Pakistan.\nHis father's name was Raja Fazal Elahi Chishti who was the District Inspector of Schools. He passed his matriculation examination from the Government School of India in 1926.\nPoetry was popular at his home. His grandfather, who was a doctor by profession and a civil/military surgeon, used to recite poetry in Urdu and Persian.\nHis father was also fond of poetry. At the age of seven or eight, he wrote his first poem, \"Inspector aur Makhiyan.\"\nThe poem depicts an inspector who had come to inspect his school and was attacked by a swarm of bees on his head and was slapping his head, back and cheeks to remove them.\nFor this poem, his father gave him a reward of one rupee. His grandfather was also happy but also urged him to stay away from poetry.\n\nIn the beginning, Rashid also wrote some hymns and naats which were published in anonymous magazines.\nIt was Rashid’s father who passed on his distinguished taste of poetry to his son, opening him to a world of works by Hafiz, Saadi, Ghalib and Iqbal.\nThat’s how Rashid became acquainted with the words of great Urdu and Persian poets.\nRashid was also influenced by English poets during his school days and he translated some of Milton, Wordsworth and Longfellow's poems and was awarded prizes for reading at school literary festivals.\n\nIn 1926, Rashid enrolled for higher studies at Government College, Lyallpur, where his subjects were English literature, history, Persian and Urdu.\nThere, he was made the student editor of the college magazine \"Bacon\" considering his poetic taste.\nDuring this time he wrote many articles in English. Even in his youth he was very fastidious.\nA magazine Zamindara Gazette was published from Lyallpur, the editor of which was his friend.\nAt his request, he took over the editorship of this magazine. He wrote many articles on village-life improvement.\nHe started participating in college poetry readings and was made the editor of the Urdu section of the college's magazine \"Ravi\".\nMany poems and humorous articles were published. Soon these works started appearing in standard magazines like \"Nigar\" and \"Humayun\".\n\nIn 1930, Rashid decided to pursue an MA in Economics after passing his BA. He also got a certificate equivalent to secondary by attending French night classes.\nHe also tried his luck in civil services but failed. In the same period, he also passed the examination of Munshi Fazil.\nDuring this period, his articles \"The Effect of Ghalib on Urdu Poetry\", \"Zafar Ali Khan's Poetry\", and \"Imtiaz Ali Taj's play Anar Kali\" etc. were published.\nIn this he had the guidance of Dr. Din Mohammad Taseer.\nAfter doing his MA, he lived with his father in different places and spent a lot of time in Sheikhupura and Multan.\n\nIn 1934, he edited Tajur Najibabadi's magazine \"Shah-kar\" but a year later parted ways.\nHe worked as a clerk in the office of the commissioner of Multan.\nAt the same time, he wrote his first independent poem, ‘Jur’at-e-Parvaz’.\nBut the Nazm which was published in the literary magazine Adabi Duniya, and stirred many a reader was ‘Ittifaqat’.\nIn 1935, he married his cousin who was his maternal uncle’s daughter.\n\nIn May 1939, he was appointed as the News Editor of All India Radio and in the same year he was made Program Assistant and then promoted to the post of Director of Programs.\nIn 1941, he was transferred to Delhi. He was also clever and opportunistic and knew how to get things done with the people around him.\nOn Delhi Radio, he was involved in the Punjabi lobby that led to the dismissal of naive poets like Majaz and Akhtar-ul-Iman.\nThanks to his own tactics, he got a temporary commission in the army in 1942 and went overseas.\nFrom 1943 to 1947, he lived in Iraq, Iran, Egypt, Ceylon (Sri Lanka), etc. under the Directorate of Inter-Services Public Relations, India.\n\nAt the end of his military service, he returned to All India Radio. He was made the Regional Director of Lucknow Station.\nAfter the partition of the country, he was assigned to the same post at Radio Pakistan Peshawar.\nHe spent one year in Peshawar and one and a half years in Lahore. Then in 1949 he was appointed Director Public Relations at Radio Pakistan Headquarters Karachi.\nHe served as the Regional Director of Peshawar Station from 1950 to 1951.\nHe joined the United Nations in 1952 and continued to work in the United Nations Information Department in New York, Jakarta, Karachi and Tehran in 1961.\n\nAfter his wife's death, he remarried in 1963. Apart from poetry, Rashid's other hobbies were horse riding, chess, and wrestling.\nHis drinking was sometimes less and sometimes more until the result of a heart condition. Doctors did not strictly forbid him, and he rarely participated in poetry recitals.\nRashid died of a heart attack in 1975 in the English town of Cheltenham and was not buried anywhere as his body was, according to his alleged will, cremated.\nThere was a great deal of resentment in Pakistan over this matter and not even regular condolence meetings were held.\n\nFour poetry collections of Rashid have come to the fore, these are, Maa-varaa (1942), Iran Mein Ajnabi (1955), Laa-Insan (1969), and Guman Ka Mumkin (1977).\nDuring his stay in Iran, he studied the works of over 80 modern Persian poets and compiled his findings in his book ‘Jadid Farsi Shayari’.\nMany of his critical essays were published in various journals which have not been published in book form.\nHe also never associated with the literary movement Halqa-e-Arbab-e-Zauq.\n\nNM Rashid has never been a popular poet like Faiz or Majaz.\nHis poetry, like all good and great poetry, demands a separate critique for itself, which itself is enlightened by its study, understanding and appreciation."
      }
   
  ]
  